nextgenx/src/main/resources/GenerateSecurityCredentialReqTemplate.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v3="http://www.westpac.com.au/gn/utility/xsd/esbHeader/v3/" xmlns:SVC0382="http://www.westpac.com.au/gn/channelManagement/services/credentialManagement/xsd/generateSecurityCredential/v1/SVC0382/" xmlns:v1="http://www.westpac.com.au/gn/common/xsd/identifiers/v1/">
<soapenv:Body>
<SVC0382:generateSecurityCredentialRequest xsi:schemaLocation="http://www.westpac.com.au/gn/channelManagement/services/credentialManagement/xsd/generateSecurityCredential/v1/SVC0382/ GenerateSecurityCredential_v1.xsd" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:SVC0382="http://www.westpac.com.au/gn/channelManagement/services/credentialManagement/xsd/generateSecurityCredential/v1/SVC0382/" xmlns:id="http://www.westpac.com.au/gn/common/xsd/identifiers/v1/">
	<requestedAction>ExchangeSecurityCredential</requestedAction>
	<securityCredentialType>SAML2.0</securityCredentialType>
	<authenticationLevel>{0}</authenticationLevel>
	<customerNumber>
		<id:customerNumber>{1}</id:customerNumber>
	</customerNumber>
</SVC0382:generateSecurityCredentialRequest>
   </soapenv:Body>
</soapenv:Envelope>